{
    "Nothing to Show Here": "Nič tu nie je",
    "It looks like there are no courses in this section right now. Check back later or explore other categories to find something new!": "Vyzerá to tak, že v tejto sekcii momentálne nie sú žiadne kurzy. Skúste to neskôr alebo preskúmajte ďalšie kategórie a objavte niečo nové!",
    "Pick Up Where You Left Off": "Pokračujte tam, kde ste skončili",
    "Continue learning with your ongoing courses. Dive back in and keep making progress toward your goals.": "Pokračujte v učení so svojimi rozbehnutými kurzami. Vráťte sa späť a postupujte ďalej k svojim cieľom.",
    "New Courses, Fresh Opportunities": "Nové kurzy, nové príležitosti",
    "Explore the latest courses added to our library. Stay updated with cutting-edge content and trending topics.":  "Preskúmajte najnovšie kurzy pridané do našej knižnice. Buďte v obraze s najaktuálnejším obsahom a trendovými témami.",
    "Browse Latest Courses": "Pozrieť najnovšie kurzy",
    "Most-Loved by Learners": "Najobľúbenejšie medzi študentmi",
    "Discover the courses that everyone is talking about. Join the crowd and explore what’s making waves.": "Objavte kurzy, o ktorých všetci hovoria. Pridajte sa k ostatným a zistite, čo je momentálne v kurze.",
    "Browse Popular Courses": "Pozrieť populárne kurzy",
    "Feeling Adventurous?": "Cítite sa dobrodružne?",
    "Browse a surprise selection of courses. Who knows? You might stumble upon your next passion.": "Prezrite si náhodný výber kurzov. Kto vie? Možno objavíte svoju novú vášeň.",
    "Browse All Courses": "Pozrieť všetky kurzy",
    "Home": "Domov",

    "Browse Courses": "Všetky kurzy",
    "Profile": "Profil",
    "Theme": "Motív",
    "Dark": "Tmavý",
    "Light": "Svetlý",
    "System": "Systémový",
    "Log Out": "Odhlásiť sa",

    "Delete Account": "Vymazať účet",
    "Once your account is deleted, all of its resources and data will be permanently deleted. Before deleting your account, please download any data or information that you wish to retain.": "Po vymazaní vášho účtu budú všetky jeho zdroje a údaje natrvalo odstránené. Pred vymazaním účtu si stiahnite všetky údaje alebo informácie, ktoré si chcete ponechať.",
    "Are you sure you want to delete your account?": "Ste si istí, že chcete vymazať svoj účet?",
    "Once your account is deleted, all of its resources and data will be permanently deleted. Please enter your password to confirm you would like to permanently delete your account.": "Po vymazaní vášho účtu budú všetky jeho zdroje a údaje natrvalo odstránené. Zadajte svoje heslo na potvrdenie, že chcete účet natrvalo vymazať.",
    "Password": "Heslo",
    "Cancel": "Zrušiť",
    "Update Password": "Aktualizovať heslo",
    "Ensure your account is using a long, random password to stay secure.": "Uistite sa, že váš účet používa dlhé a náhodné heslo pre vyššiu bezpečnosť.",
    "Current Password": "Súčasné heslo",
    "New Password": "Nové heslo",
    "Confirm Password": "Potvrdiť heslo",
    "Save": "Uložiť",
    "Profile Information": "Informácie o profile",
    "Update your account's profile information and email address.": "Aktualizujte informácie o profile a e-mailovú adresu vášho účtu.",
    "A new verification link has been sent to your email address.": "Nový overovací odkaz bol odoslaný na vašu e-mailovú adresu.",
    "Name": "Meno",
    "E-Mail": "E-Mail",
    "Your email address is unverified.": "Vaša e-mailová adresa nie je overená.",
    "Click here to re-send the verification email.": "Kliknite sem na opätovné odoslanie overovacieho e-mailu.",

    "Saved.": "Uložené.",
    "Completed": "Dokončené",
    ":value% In Progress": "Prebieha - :value%",

    "All Courses": "Všetky kurzy",
    "Categories": "Kategórie",
    "Filter": "Filter",
    "Hide Completed": "Skryť dokončené",
    "No Courses Available": "Žiadne dostupné kurzy",
    "There are no video courses available right now. Please check back later!": "Momentálne nie sú dostupné žiadne video kurzy. Skúste to neskôr!",
    "Latest": "Najnovšie",
    "Popular": "Populárne",
    "A-Z": "A-Z",
    "Z-A": "Z-A",
    "of": "z",

    "About Course": "O kurze",
    "Lessons": "Lekcie",
    "Course Completed!": "Kurz dokončený!",
    ":value% completed": ":value% dokončené",
    "Start Learning": "Začať sa učiť",
    "Continue Learning": "Pokračovať v učení",
    "Browse Lessons": "Prehliadať lekcie",
    "Enroll": "Zapísať sa",
    "Start Over": "Začať odznova",
    "Are you sure you want to restart this course? Your current progress will be reset, and you’ll begin from the very first lesson. This action cannot be undone.": "Ste si istí, že chcete reštartovať tento kurz? Váš aktuálny pokrok bude vynulovaný a začnete od prvej lekcie. Táto akcia je nevratná.",
    "Start Over?": "Začať odznova?",
    "Keep Progress": "Zachovať pokrok",

    "Leave Course": "Opustiť kurz",
    "Continue": "Pokračovať",
    "Next lesson starts in :time…": "Ďalšia lekcia začína o :time…",
    "Lesson completed!": "Lekcia dokončená!",
    "Start playing automatically": "Spustiť prehrávanie automaticky",
    "Start next lesson automatically": "Spustiť ďalšiu lekciu automaticky",
    "Lesson Completed": "Dokončené",
    "Mark Completed": "Označiť ako dokončené",
    "Previous Lesson": "Predchádzajúca lekcia",
    "Finish Course": "Dokončiť kurz",
    "Next Lesson": "Ďalšia lekcia",
    "Description": "Popis",
    "Resources": "Zdroje",
    "Congratulations!": "Gratulujeme!",
    "You did it! You’ve officially completed the course.": "Dokázali ste to! Oficiálne ste dokončili kurz.",
    "Taking the time and effort to learn something new is no small feat, and you should be proud of yourself for making it through to the end.": "Venovať čas a úsilie učeniu sa niečoho nového nie je maličkosť, a mali by ste byť na seba hrdí, že ste to dotiahli až do konca.",
    "Lesson :value": "Lekcia :value",

    "This is a secure area of the application. Please confirm your password before continuing.": "Toto je zabezpečená časť aplikácie. Pred pokračovaním zadajte svoje heslo.",
    "Confirm": "Potvrdiť",
    "Forgot Password": "Zabudnuté heslo",
    "Login": "Prihlásiť sa",
    "Forgot your password? No problem. Just let us know your email address and we will email you a password reset link that will allow you to choose a new one.": "Zabudli ste heslo? Žiadny problém. Stačí nám poskytnúť svoju e-mailovú adresu a my vám pošleme odkaz na obnovenie hesla, aby ste si mohli vytvoriť nové.",
    "Email Password Reset Link": "Odoslať odkaz na obnovenie hesla",
    "Log in": "Prihlásiť sa",
    "Register": "Registrovať sa",
    "Remember me": "Zapamätať si ma",
    "Forgot your password?": "Zabudli ste heslo?",
    "Create an account": "Vytvoriť účet",
    "Confirm Password": "Potvrdiť heslo",
    "Invitation Code": "Kód pozvánky",
    "Reset Password": "Obnoviť heslo",
    "Email Verification": "Overenie e-mailu",
    "Log Out": "Odhlásiť sa",
    "A new verification link has been sent to the email address you provided during registration.": "Nový overovací odkaz bol odoslaný na e-mailovú adresu, ktorú ste zadali pri registrácii.",
    "Thanks for signing up! Before getting started, could you verify your email address by clicking on the link we just emailed to you? If you didn't receive the email, we will gladly send you another.": "Ďakujeme za registráciu! Predtým, než začnete, overte svoju e-mailovú adresu kliknutím na odkaz, ktorý sme vám práve poslali. Ak ste e-mail nedostali, radi vám pošleme nový.",
    "Resend Verification Email": "Znovu odoslať overovací e-mail"

}
